app/Http/Controllers/CommentController.php

    public function store(Request $req){
        Comment::create([
            'content' => $req->content,
            'post_id' => $req->post_id
        ]);
        return redirect()->route('posts.show', [$req->post_id, 'comments' => Comment::all()]);
---
insert into "comments" ("content", "post_id", "updated_at", "created_at") values ('ertyuikjvfcvbnm', '1', '2022-10-03 11:05:10', '2022-10-03 11:05:10') returning "id"
select * from "comments"

    public function destroy(Comment $comment){
        $comment->delete();
---
delete from "comments" where "id" = 3