app/Http/Controllers/PostController.php

    public function postsByCategory(Category $category){
        return view('posts.index', ['posts' => $category->posts, 'categories' => Category::all()]);
---
select * from "posts"

    public function index(){
        $posts = Post::all();
        return view('posts.index', ['posts' =>$posts, 'categories' => Category::all()]);
---
select * from "posts"
select * from "categories"

    public function create(){
        return view('posts.create', ['categories' => Category::all()]);
---
select * from "categories"

    public function store(Request $req){
        Post::create([
            'title' => $req->title,
            'content' => $req->content,
            'category_id' => $req->category_id
        ]);
---
insert into "posts" ("title", "content", "category_id", "updated_at", "created_at") values ('wsedrftgyhujiko', 'edrftyguhijmo', '1', '2022-10-03 11:04:50', '2022-10-03 11:04:50') returning "id"

    public function show(Post $post){
        $comments = Comment::all();
---
select * from "comments"

    public function edit(Post $post){
        return view('posts.edit', ['post' => $post, 'categories' => Category::all()]);
---
select * from "categories"

        public function destroy(Post $post){
        $post->delete();
---
delete from "posts" where "id" = 3